In [50]:
'''

    #       # #   # ##### ####### #
    # #   # # \  /  #     #     # #
    #   #   #  \/   ##### #     # #
    #       #  #        # #  #### #
    #       #  #    ##### ####### ######
    
   Author name: Tarun Sharma 
   Schema Name: The WareHouse
'''

'\n\n    #       # #   # ##### ####### #\n    # #   # # \\  /  #     #     # #\n    #   #   #  \\/   ##### #     # #\n    #       #  #        # #  #### #\n    #       #  #    ##### ####### ######\n    \n   Author name: Tarun Sharma \n   Schema Name: The WareHouse\n'

In [4]:
import sqlalchemy
import pymysql

In [6]:
pymysql.install_as_MySQLdb()

In [10]:
sqlalchemy.create_engine('mysql://root:root@localhost/The_warehouse')

Engine(mysql://root:***@localhost/The_warehouse)

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
%sql mysql://root:root@localhost/The_warehouse

In [15]:
%%sql
CREATE TABLE Warehouses (
   Code INTEGER NOT NULL,
   Location VARCHAR(255) NOT NULL ,
   Capacity INTEGER NOT NULL,
   PRIMARY KEY (Code)
 );

 * mysql://root:***@localhost/The_warehouse
0 rows affected.

[]

In [17]:
%%sql
CREATE TABLE Boxes (
    Code CHAR(4) NOT NULL,
    Contents VARCHAR(255) NOT NULL ,
    Value REAL NOT NULL ,
    Warehouse INTEGER NOT NULL,
    PRIMARY KEY (Code),
    FOREIGN KEY (Warehouse) REFERENCES Warehouses(Code)
 ) ENGINE=INNODB;

 * mysql://root:***@localhost/The_warehouse
0 rows affected.

[]

In [18]:
%%sql
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(1,'Chicago',3);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(2,'Chicago',4);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(3,'New York',7);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(4,'Los Angeles',2);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(5,'San Francisco',8);
 
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('0MN7','Rocks',180,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4H8P','Rocks',250,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4RT3','Scissors',190,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('7G3H','Rocks',200,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8JN6','Papers',75,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8Y6U','Papers',50,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('9J6F','Papers',175,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('LL08','Rocks',140,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P0H6','Scissors',125,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P2T6','Scissors',150,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('TU55','Papers',90,5);

 * mysql://root:***@localhost/The_warehouse
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql
show tables

 * mysql://root:***@localhost/The_warehouse
2 rows affected.

[('Boxes',), ('Warehouses',)]

In [20]:
%%sql
select * from Warehouses;

 * mysql://root:***@localhost/The_warehouse
5 rows affected.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8)]

In [21]:
%%sql
select * from Boxes;

 * mysql://root:***@localhost/The_warehouse
11 rows affected.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('8JN6', 'Papers', 75.0, 1),
 ('8Y6U', 'Papers', 50.0, 3),
 ('9J6F', 'Papers', 175.0, 2),
 ('LL08', 'Rocks', 140.0, 4),
 ('P0H6', 'Scissors', 125.0, 1),
 ('P2T6', 'Scissors', 150.0, 2),
 ('TU55', 'Papers', 90.0, 5)]

In [22]:
%%sql
select distinct Contents from Boxes;

 * mysql://root:***@localhost/The_warehouse
3 rows affected.

[('Rocks',), ('Scissors',), ('Papers',)]

In [23]:
%%sql
select avg(Value) from Boxes;

 * mysql://root:***@localhost/The_warehouse
1 rows affected.

[(147.72727272727272,)]

In [29]:
%%sql
select Warehouse, avg(Value) from Boxes group by Warehouse;

 * mysql://root:***@localhost/The_warehouse
5 rows affected.

[(1, 162.5), (2, 162.5), (3, 115.0), (4, 165.0), (5, 90.0)]

In [30]:
%%sql
-- Same as previous exercise, but select only those warehouses where the average value of the boxes is greater than 150.
select Warehouse, avg(Value) 
from Boxes 
group by Warehouse
having avg(Value)> 150;

 * mysql://root:***@localhost/The_warehouse
3 rows affected.

[(1, 162.5), (2, 162.5), (4, 165.0)]

In [32]:
%%sql
-- Select the code of each box, along with the name of the city the box is located in.
select Boxes.Code, Warehouses.location
from Boxes join Warehouses
on Boxes.Warehouse = Warehouses.Code;

 * mysql://root:***@localhost/The_warehouse
11 rows affected.

[('4H8P', 'Chicago'),
 ('7G3H', 'Chicago'),
 ('8JN6', 'Chicago'),
 ('P0H6', 'Chicago'),
 ('9J6F', 'Chicago'),
 ('P2T6', 'Chicago'),
 ('0MN7', 'New York'),
 ('8Y6U', 'New York'),
 ('4RT3', 'Los Angeles'),
 ('LL08', 'Los Angeles'),
 ('TU55', 'San Francisco')]

In [33]:
%%sql
SELECT Boxes.Code, Location
      FROM Warehouses 
INNER JOIN Boxes ON Warehouses.Code = Boxes.Warehouse;

 * mysql://root:***@localhost/The_warehouse
11 rows affected.

[('4H8P', 'Chicago'),
 ('7G3H', 'Chicago'),
 ('8JN6', 'Chicago'),
 ('P0H6', 'Chicago'),
 ('9J6F', 'Chicago'),
 ('P2T6', 'Chicago'),
 ('0MN7', 'New York'),
 ('8Y6U', 'New York'),
 ('4RT3', 'Los Angeles'),
 ('LL08', 'Los Angeles'),
 ('TU55', 'San Francisco')]

In [35]:
%%sql
-- Select the warehouse codes, along with the number of boxes in each warehouse. 
-- Optionally, take into account that some warehouses are empty (i.e., the box count should show up as zero, instead of omitting the warehouse from the result).
select Warehouse, count(*) as num_of_boxes
from Boxes 
group by Warehouse;

 * mysql://root:***@localhost/The_warehouse
5 rows affected.

[(1, 4), (2, 2), (3, 2), (4, 2), (5, 1)]

In [36]:
%%sql
-- Select the codes of all warehouses that are saturated (a warehouse is saturated if the number of boxes in it is larger than the warehouse's capacity).
SELECT Code
   FROM Warehouses
   WHERE Capacity <
   (
     SELECT COUNT(*)
       FROM Boxes
       WHERE Warehouse = Warehouses.Code
   );

 * mysql://root:***@localhost/The_warehouse
1 rows affected.

[(1,)]

In [42]:
%%sql
select * from Boxes;

 * mysql://root:***@localhost/The_warehouse
11 rows affected.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('8JN6', 'Papers', 75.0, 1),
 ('8Y6U', 'Papers', 50.0, 3),
 ('9J6F', 'Papers', 175.0, 2),
 ('LL08', 'Rocks', 140.0, 4),
 ('P0H6', 'Scissors', 125.0, 1),
 ('P2T6', 'Scissors', 150.0, 2),
 ('TU55', 'Papers', 90.0, 5)]

In [43]:
%%sql
-- Select the codes of all the boxes located in Chicago.
select Boxes.Code 
from Boxes join Warehouses
on Boxes.Warehouse = Warehouses.Code
where Warehouses.Location = 'Chicago';

 * mysql://root:***@localhost/The_warehouse
6 rows affected.

[('4H8P',), ('7G3H',), ('8JN6',), ('P0H6',), ('9J6F',), ('P2T6',)]

In [44]:
%%sql
/* With a subquery */
SELECT Code
FROM Boxes
WHERE Warehouse IN
(
     SELECT Code
     FROM Warehouses
     WHERE Location = 'Chicago'
);

 * mysql://root:***@localhost/The_warehouse
6 rows affected.

[('4H8P',), ('7G3H',), ('8JN6',), ('P0H6',), ('9J6F',), ('P2T6',)]

In [45]:
%%sql
-- Create a new warehouse in New York with a capacity for 3 boxes.
INSERT INTO Warehouses VALUES (6, 'New York', 3);

 * mysql://root:***@localhost/The_warehouse
1 rows affected.

[]

In [46]:
%%sql
INSERT INTO Boxes VALUES('H5RT', 'Papers', 200, 2);

 * mysql://root:***@localhost/The_warehouse
1 rows affected.

[]

In [47]:
%%sql
-- Reduce the value of all boxes by 15%.
update Boxes
set Value = Value * 0.85;

 * mysql://root:***@localhost/The_warehouse
12 rows affected.

[]

In [49]:
%%sql
delete from Boxes 
where Value < 100;

 * mysql://root:***@localhost/The_warehouse
3 rows affected.

[]

In [ ]:
%%sql
-- Remove all boxes from saturated warehouses.
delete from Boxes
where Warehouse in
(
   SELECT Code
   FROM Warehouses
   WHERE Capacity <
   (
       SELECT COUNT(*)
       FROM Boxes
       WHERE Warehouse = Warehouses.Code
   )
);

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

uPdate soon...if some addition is required...